{"Plants":[{"name":"Susie","shortName":"Snake Plant","fullName":["Sansevieria","Mother-in-law's tongue","Viper's bowstring hemp"],"highlights":["Most light conditions","Almost unkillable"],"likesSection":{"Light watering":"She doesn't need much water. Give her a drink when her soil feels dry, about every few weeks. Less in winter.","Most light conditions":"She’ll thrive in almost all light conditions (though not a windowless room). More is better, but anything is fine.","Dusting":"Every now and again - just whenever you remember - give her leaves a light wipe to keep her pores free of dust."},"quickFactsSection":{"botanical name":"Sansevieria trifasciata","nickname":"Snake plant; Mother-in-Law’s tongue; Viper’s bowstring hemp","plant type":"Indoor; evergreen perennial","air purifying":"Yes","plant height (including pot)":"35-45cm; 50-60cm; 70-80cm; 100-110cm","pet/baby safe":"Mildly toxic if ingested","nursery pot size":"12cm; 17cm; 21cm; 32cm"},"aboutText":"If you’ve never taken care of a plant before and want an easy start, the snake plant is the one for you. You’d have to try pretty hard to actually kill one. It thrives on neglect, responding best to the lightest of watering and then just being left alone. It will appreciate a feed with liquid fertiliser once per month in spring and summer, but that's about as much special attention as it needs.It's a great bedroom plant as it stores up oxygen throughout the day, then releases it all at night.Low-key as it is, the snake plant has long been treasured all over the world. In Nigeria, it's associated with Ogun, the deity of war. In other parts of Africa, it's connected to Oya, the bringer of storms. In China, it's the ‘Tiger’s tail orchid’; in Japan, the ‘Tiger’s tail’; in Brazil, the ‘Sword of Saint George’; in Russia, ‘Pike’s tail’. Basically, this plant is pretty famous.For more very easy plants, check out our Unkillables range. \n\nAnother nickname for this plant is ‘Viper’s bowstring hemp’, because its strong fibres were once used to make strings for bows."}]}